{
	"summary": "Pythonista 🐍 | Coder | Traveller | Computer Enthusiast | Thai Culture | South Africa | Remote worker | Freelancer | Equal rights",
	"hello": [
		"<p>Hi, I’m Dirk. I am a Software Architect and Programmer. I've been writing code for 20+ years.</p>",
		"<p>Writing good quality code is a passion. I believe in simplicity, elegance and creating software to make our lives easier, and better. </p>",
		"<p>Currently I'm working at <a target='_blank' href='https://www.gpstrategies.com'>GP Strategies</a> as a Software Architect. The role spans multiple facets. Front and back end development, data modelling, and architecting new solutions.</p>",
		"<br />",
		"<b>IDEAS:</b>",
		"<p>Constantly evolving legacy code to be leading edge so that systems never fall behind.</p>",
		"<p>Recursion - how far does the rabbit hole go?</p>",
		"<p>Introspection - how do we get the computer to think in terms that are meaningful to us?</p>"
    ],
    "contact2": "<h5>Contact Us</h5><p>Please contact us if you think we can help you.</p>",
    "pages": [
        {
            "sn": 0,
            "tab": "Architect",
            "title": "Consulting Software Architect",
            "enabled": true,
            "text": [
                "<p>Hi, I’m Dirk. I am a Software Architect and Programmer. I've been writing code for 20+ years.</p>",
                "<p>Guiding teams to write good quality code is a passion. I believe in simplicity, elegance and creating software to make our lives easier, and better. Good software mirrors our thinking and empowers us.</p>",
                "<p>Currently my company delivers architectural services and consultations to clients based anywhere on the globe. Some of our clients include <a target='_blank' href='https://www.gpstrategies.com'>GP Strategies</a>, (a New York stock exchange listed company) and <a target='_blank' href='http://www.inspired.org'>Inspired.org</a> (a leader in Enterprise Architecture research and training in South Africa).</p>",
                "<br />",
                "<b>IDEAS:</b>",
                "<p>Constantly evolving legacy code to be leading edge so that systems never fall behind.</p>",
                "<p>Recursion - how far does the rabbit hole go?</p>",
                "<p>Introspection - how do we get the computer to think in terms that are meaningful to us?</p>"
            ]
        },
        {
            "sn": 1,
            "tab": "current",
            "title": "Analyse Current Code",
            "enabled": true,
            "text": [
                "<p>If you work in a large organisation, chances are the codebase has gotten a mind of its own, and feels woolly, living in few or scattered minds. Perhaps you are unusuare of code quality and maintainability has become a challenge?</p>",
                "<p></p>",
                "<p>The best thing for this situation is a proper code review by an experienced architect. An architect will try to make sense of everything and summarise into an application architecture, information architecture and infrastruction architecture. The aim is that these makes these dimensions easily accessible for the whole team, planners, and new joiners alike.</p>",
                "<p>This constitutes the 'current scenario'. This might be enough to start with. The next logical step is to then to sit down and strategise the 'future plan'. We can produce a set of application, information, and infrastructure architectures for these as well.</p>",
                "<p></p>",
                "<p>We will review the code base, and document the classes and database tables or graph structure, and keep them up to date.</p>",
                "<p>We can document progress diagrams for any critical or desired areas and keep them up to date.</p>",

                "<h4>Architecture Drawings</h4>",
                "<p></p>",
                "<p>Wondering why do we love diagrams so much? Their power is in condensing meaning to simple pictures. Done well, visual information can be understood at a fast speed. Visual language is a great way for new people to come on board and quickly get to grips with the project. They are also incredible at reporting progress.</p>",
                "<p>Architectural drawings can also be a specifications that developers can take away and build.</p>",
                "<p></p>"
            ]
        },
        {
            "sn": 2,
            "tab": "legacy",
            "title": "Legacy Applications/Code",
            "enabled": true,
            "text": [
                "<p>Often a lot of hard work, and investment has gone into building legacy applications. Often we have also put in a lot of thought into them.<p>",
                "<p>What do we mean by legacy applications? This is code has become a little dated and not quite as shiny as it once was.</p>",
                "<p></p>",
                "<p>Typically the core logic is still solid, but over time the UI (look and feel) tends to have become a bit lacklustre. The other thing that can happen is that the technology it runs on may now not be current.</p>",
                "<p>It is also possible the datamodel needs updating.</p>",
                "<p></p>",
                "<p>What makes it legacy is when it reaches that point where people are too afraid to update the application anymore because it still 'works'. Typically, it still works pretty darn well, but just needs a bit of love.</p>",
                "<p></p>",
                "<h4>The services we offer are:</h4>",
                "<ul class='browser-default'>",
                    "<li>Analyse legacy applications / code bases</li>",
                    "<li>Diagram and document them</li>",
                    "<li>Architect a plan for modernising and revitalising them</li>",
                "</ul>",
                "<p></p>",
                "<p>Please contact us for a quote.</p>",
                "<p>Our principles are to keep your  proprietary information in strictest confidence and will gladly sign any NDAs.</p>"
            ]
        },
        {
            "sn": 3,
            "tab": "new_products",
            "title": "New Product Design",
            "enabled": true,
            "text": [
                "<p>If you are an entrepreneur with a new software idea, you may benefit greatly from a kind ear to bounce ideas off. We offer a Skype call service where you can ring us and discuss some ideas.</p>",
                "<p></p>",
                "<h4>The services we offer are:</h4>",
                "<ul class='browser-default'>",
                    "<li>Listen to new product ideas</li>",
                    "<li>Give feedback on feasibility</li>",
                    "<li>Stimulate thinking with fresh ideas</li>",
                    "<li>Diagram and produce an Architectural Design</li>",
                    "<li>Become a Non-executive director on your board</li>",
                "</ul>",
                "<p></p>",
                "<p>Please contact us for more info.</p>",
                "<p></p>",
                "<p><b><i>Disclaimer:</i></b> Scared of us stealing your ideas? Our reputation is important to us. We will sign a NDA, and keep the ideas in the strictest confidence. Also, if there is any conflict of interest we will let you know and not take the project on.</p>"
            ]
        },
        {
            "sn": 3,
            "tab": "samples",
            "title": "Examples",
            "enabled": false,
            "text": [
                "<p>",
                    "<img src='class_diagram.png'>",
                    "<b>Class Diagram</b>",
                "</p>",
                "<a href='class_diagram.png'>Process Diagram</a>",
                "<a href='class_diagram.png'>Work Plan</a>"
            ]
        }
    ]
}